Revit 2027 API
ReleaseConditions(Boolean) Constructor
 Creates a new instance of ReleaseConditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReleaseConditions(
	bool start
)
Public Sub New (
	start As Boolean
)
public:
ReleaseConditions(
	bool start
)
new :
        start : bool -> ReleaseConditions
Parameters
start Boolean
 The position on analytical element. True for start, false for end.
See Also
Reference
ReleaseConditions Class
ReleaseConditions Overload
Autodesk.Revit.DB.Structure Namespace